react.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-31 Tue 15:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="/org"> HOME </a>
</div><div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc419143">1. React</a>
<ul>
<li><a href="#orgf4bf3aa">1.1. Flux</a>
<ul>
<li><a href="#orgba07274">1.1.1. <span class="todo TODO">TODO</span> Basic architecture</a></li>
<li><a href="#orgb45695b">1.1.2. Evolution</a>
<ul>
<li><a href="#org573da41">1.1.2.1. Flux tradeoff examples</a></li>
<li><a href="#orgb347211">1.1.2.2. Key developments</a></li>
</ul>
</li>
<li><a href="#org3733392">1.1.3. Notable variants</a></li>
</ul>
</li>
<li><a href="#org529f7e8">1.2. Este.js</a>
<ul>
<li><a href="#orgc47c616">1.2.1. <span class="done DONE">DONE</span> App structure</a>
<ul>
<li><a href="#org131e867">1.2.1.1. main.js</a></li>
<li><a href="#orge349d14">1.2.1.2. routes.js</a></li>
<li><a href="#orgaef86fd">1.2.1.3. App</a></li>
<li><a href="#orge183bcb">1.2.1.4. Pages</a></li>
<li><a href="#org25eca4c">1.2.1.5. Components</a></li>
<li><a href="#orgbfd8c02">1.2.1.6. Actions</a></li>
<li><a href="#orge644fd3">1.2.1.7. Stores</a></li>
</ul>
</li>
<li><a href="#org060c51a">1.2.2. <span class="done DONE">DONE</span> State</a>
<ul>
<li><a href="#org01fdf02">1.2.2.1. <span class="done DONE">DONE</span> Pending actions</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb3d27ac">1.3. Concepts</a>
<ul>
<li><a href="#org396f016">1.3.1. <span class="done DONE">DONE</span> Immutable data structures</a>
<ul>
<li><a href="#orgf10a21b">1.3.1.1. Optimizations</a></li>
<li><a href="#org24bec02">1.3.1.2. API</a></li>
</ul>
</li>
<li><a href="#org9d18eee">1.3.2. <span class="done DONE">DONE</span> PropTypes</a></li>
<li><a href="#org35c881c">1.3.3. <span class="todo TODO">TODO</span> Higher order components </a>
<ul>
<li><a href="#org1e391bf">1.3.3.1. Mixins</a></li>
<li><a href="#org27a6c29">1.3.3.2. Higher-order components</a></li>
</ul>
</li>
<li><a href="#orgc93bac6">1.3.4. <span class="done DONE">DONE</span> Routing</a>
<ul>
<li><a href="#org9c96943">1.3.4.1. <span class="todo TODO">TODO</span> Followup: </a></li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
<li><a href="#org98f94e2">2. <span class="todo TODO">TODO</span> Webpack</a></li>
<li><a href="#orge9a6ddf">3. Followups</a>
<ul>
<li><a href="#org0c687b8">3.1. <span class="todo TODO">TODO</span> </a></li>
<li><a href="#org3b34470">3.2. <span class="todo TODO">TODO</span> </a></li>
<li><a href="#org83e63da">3.3. <span class="todo TODO">TODO</span> </a></li>
<li><a href="#orgf2636b8">3.4. <span class="todo TODO">TODO</span> </a></li>
<li><a href="#org28d53ea">3.5. <span class="todo TODO">TODO</span> </a></li>
<li><a href="#org25a4fb2">3.6. <span class="todo TODO">TODO</span> cursors e.g. </a></li>
<li><a href="#org7d94406">3.7. <span class="todo TODO">TODO</span> watch </a></li>
<li><a href="#org3f83947">3.8. <span class="todo TODO">TODO</span> watch React Europe </a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgc419143" class="outline-2">
<h2 id="orgc419143"><span class="section-number-2">1</span> React</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgf4bf3aa" class="outline-3">
<h3 id="orgf4bf3aa"><span class="section-number-3">1.1</span> Flux</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-orgba07274" class="outline-4">
<h4 id="orgba07274"><span class="section-number-4">1.1.1</span> <span class="todo TODO">TODO</span> Basic architecture</h4>
</div>
<div id="outline-container-orgb45695b" class="outline-4">
<h4 id="orgb45695b"><span class="section-number-4">1.1.2</span> Evolution</h4>
<div class="outline-text-4" id="text-1-1-2">
</div><div id="outline-container-org573da41" class="outline-5">
<h5 id="org573da41"><span class="section-number-5">1.1.2.1</span> Flux tradeoff examples</h5>
<div class="outline-text-5" id="text-1-1-2-1">
<ul class="org-ul">
<li>If actions aren't objects, it is harder to replay them for debugging purposes.</li>
<li>Having no type constants makes it harder to typecheck actions with Flow.</li>
</ul>
</div>
</div>

<div id="outline-container-orgb347211" class="outline-5">
<h5 id="orgb347211"><span class="section-number-5">1.1.2.2</span> Key developments</h5>
<div class="outline-text-5" id="text-1-1-2-2">
<p>
The first thing is action creators returning dispatched actions. The evolution is from 
</p>
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #b5bd68;">export</span> <span style="color: #b5bd68;">function</span> addTodo<span style="color: #c5c8c6;">(</span><span style="color: #f0c674;">text</span><span style="color: #c5c8c6;">)</span> <span style="color: #c5c8c6;">{</span>
  AppDispatcher.dispatch<span style="color: #8abeb7;">(</span><span style="color: #f0c674;">{</span>
    type: ActionTypes.ADD_TODO,
    text: text
  <span style="color: #f0c674;">}</span><span style="color: #8abeb7;">)</span>;
<span style="color: #c5c8c6;">}</span>
</pre>
</div>

<p>
to
</p>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #b5bd68;">export</span> <span style="color: #b5bd68;">function</span> addTodo<span style="color: #c5c8c6;">(</span><span style="color: #f0c674;">text</span><span style="color: #c5c8c6;">)</span> <span style="color: #c5c8c6;">{</span>
  <span style="color: #b5bd68;">return</span> <span style="color: #8abeb7;">{</span>
    type: ActionTypes.ADD_TODO,
    text: text
  <span style="color: #8abeb7;">}</span>;
<span style="color: #c5c8c6;">}</span>
</pre>
</div>

<p>
Obviously, the actions become decoupled from the dispatcher - IoC kicks in.
The consequence here is that action creators cannot be called directly.
Practically, you'd wrap them anyway (or use a library) for server side rendering.
</p>

<p>
Async action creators would work as follows:
</p>
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #b5bd68;">export</span> <span style="color: #b5bd68;">function</span> addTodo<span style="color: #c5c8c6;">(</span><span style="color: #f0c674;">text</span><span style="color: #c5c8c6;">)</span> <span style="color: #c5c8c6;">{</span>
  <span style="color: #b5bd68;">return</span> dispatch =&gt; <span style="color: #8abeb7;">(</span><span style="color: #f0c674;">{</span>
    dispatch<span style="color: #b5bd68;">(</span><span style="color: #81a2be;">{</span>
      type: ActionTypes.ADD_TODO,
      text: text
    <span style="color: #81a2be;">}</span><span style="color: #b5bd68;">)</span>;
    API.addTodo<span style="color: #b5bd68;">(</span>text<span style="color: #b5bd68;">)</span>.then<span style="color: #b5bd68;">(</span>
        <span style="color: #81a2be;">()</span> =&gt; dispatch<span style="color: #81a2be;">(</span><span style="color: #c5c8c6;">{</span>
        type: ActionTypes.ADD_TODO_SUCCESS,
        text: text
        <span style="color: #c5c8c6;">}</span><span style="color: #81a2be;">)</span>,
        <span style="color: #81a2be;">()</span> =&gt; dispatch<span style="color: #81a2be;">(</span><span style="color: #c5c8c6;">{</span>
        type: ActionTypes.ADD_TODO_FAILURE,
        text: text
        <span style="color: #c5c8c6;">}</span><span style="color: #81a2be;">)</span>
    <span style="color: #b5bd68;">)</span>;
  <span style="color: #f0c674;">}</span><span style="color: #8abeb7;">)</span>;
<span style="color: #c5c8c6;">}</span>
</pre>
</div>

<p>
The second thing is thanks to that the Stores can be made stateless.
An inherent features of Stores is that they <b>managed</b>, not <b>own</b> state.
A 'default' implementation of a store would look somewhat like this:
</p>
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #b5bd68;">let</span> <span style="color: #f0c674;">_todos</span> = <span style="color: #c5c8c6;">[]</span>;
<span style="color: #b5bd68;">const</span> <span style="color: #f0c674;">TodoStore</span> = Object.assign<span style="color: #c5c8c6;">(</span><span style="color: #b5bd68;">new</span> <span style="color: #81a2be;">EventEmitter</span><span style="color: #8abeb7;">()</span>, <span style="color: #8abeb7;">{</span>
  getTodos<span style="color: #f0c674;">()</span> <span style="color: #f0c674;">{</span>
    <span style="color: #b5bd68;">return</span> _todos;
  <span style="color: #f0c674;">}</span>
<span style="color: #8abeb7;">}</span><span style="color: #c5c8c6;">)</span>;
AppDispatcher.register<span style="color: #c5c8c6;">(</span><span style="color: #b5bd68;">function</span> <span style="color: #8abeb7;">(</span><span style="color: #f0c674;">action</span><span style="color: #8abeb7;">)</span> <span style="color: #8abeb7;">{</span>
  <span style="color: #b5bd68;">switch</span> <span style="color: #f0c674;">(</span>action.type<span style="color: #f0c674;">)</span> <span style="color: #f0c674;">{</span>
  <span style="color: #b5bd68;">case</span> ActionTypes.ADD_TODO:
    _todos = _todos.concat<span style="color: #b5bd68;">(</span><span style="color: #81a2be;">[</span>action.text<span style="color: #81a2be;">]</span><span style="color: #b5bd68;">)</span>;
    TodoStore.emitChange<span style="color: #b5bd68;">()</span>;
    <span style="color: #b5bd68;">break</span>;
  <span style="color: #f0c674;">}</span>
<span style="color: #8abeb7;">}</span><span style="color: #c5c8c6;">)</span>;
<span style="color: #b5bd68;">export</span> <span style="color: #b5bd68;">default</span> TodoStore;
</pre>
</div>

<p>
can be turned into:
</p>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #b5bd68;">const</span> <span style="color: #f0c674;">initialState</span> = <span style="color: #c5c8c6;">{</span> todos: <span style="color: #8abeb7;">[]</span> <span style="color: #c5c8c6;">}</span>;
<span style="color: #b5bd68;">export</span> <span style="color: #b5bd68;">default</span> <span style="color: #b5bd68;">function</span> TodoStore<span style="color: #c5c8c6;">(</span><span style="color: #f0c674;">state</span> = <span style="color: #f0c674;">initialState</span>, <span style="color: #f0c674;">action</span><span style="color: #c5c8c6;">)</span> <span style="color: #c5c8c6;">{</span>
  <span style="color: #b5bd68;">switch</span> <span style="color: #8abeb7;">(</span>action.type<span style="color: #8abeb7;">)</span> <span style="color: #8abeb7;">{</span>
  <span style="color: #b5bd68;">case</span> ActionTypes.ADD_TODO:
    <span style="color: #b5bd68;">return</span> <span style="color: #f0c674;">{</span> todos: state.todos.concat<span style="color: #b5bd68;">(</span><span style="color: #81a2be;">[</span>action.text<span style="color: #81a2be;">]</span><span style="color: #b5bd68;">)</span> <span style="color: #f0c674;">}</span>;
  <span style="color: #b5bd68;">default</span>:
    <span style="color: #b5bd68;">return</span> state;
<span style="color: #8abeb7;">}</span>
</pre>
</div>

<p>
So the state of a Store is a function of its initial state and the actions that have been performed on it.
</p>

<p>
Benefits of those advancements:
</p>
<ul class="org-ul">
<li>Testability in isolation</li>
<li>Hot reloading (done in <a href="https://github.com/gaearon/redux">redux</a>)</li>
<li>The dispatcher owns the state and can revert the application to any previous state without serialization.
This means transactionality out of the box, allowing for stuff like <a href="https://github.com/gaearon/redux-devtools">https://github.com/gaearon/redux-devtools</a>.</li>
<li>No need to <code>waitFor()</code> - the dispatcher controls when changes are emitted.</li>
<li>Change updates can be subscribed to, but the dispatcher may also expose a cursor-like functionality.</li>
<li>Declarative style - focus on <b>what</b> instead of <b>how</b>.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org3733392" class="outline-4">
<h4 id="org3733392"><span class="section-number-4">1.1.3</span> Notable variants</h4>
<div class="outline-text-4" id="text-1-1-3">
<ul class="org-ul">
<li><a href="https://github.com/gaearon/redux">Redux</a></li>

<li><a href="https://acdlite.github.io/flummox">Flummox</a></li>
<li><a href="https://github.com/spoike/refluxjs">Reflux</a></li>
</ul>
</div>
</div>
</div>
