react.html

<div id="outline-container-org529f7e8" class="outline-3">
<h3 id="org529f7e8"><span class="section-number-3">1.2</span> Este.js</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-orgc47c616" class="outline-4">
<h4 id="orgc47c616"><span class="section-number-4">1.2.1</span> <span class="done DONE">DONE</span> App structure</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
This is a top-down overview of an Este.js app structure.
</p>
</div>
<div id="outline-container-org131e867" class="outline-5">
<h5 id="org131e867"><span class="section-number-5">1.2.1.1</span> main.js</h5>
<div class="outline-text-5" id="text-1-2-1-1">
<ul class="org-ul">
<li>Imports routes.</li>
<li>Bootstraps the application: renders the Router component in the given DOM root.</li>
</ul>
</div>
</div>
<div id="outline-container-orge349d14" class="outline-5">
<h5 id="orge349d14"><span class="section-number-5">1.2.1.2</span> routes.js</h5>
<div class="outline-text-5" id="text-1-2-1-2">
<ul class="org-ul">
<li>Imports top-level components for all pages.</li>
</ul>
</div>
</div>
<div id="outline-container-orgaef86fd" class="outline-5">
<h5 id="orgaef86fd"><span class="section-number-5">1.2.1.3</span> App</h5>
<div class="outline-text-5" id="text-1-2-1-3">
<ul class="org-ul">
<li>Imports all stores.</li>
<li>Renders the main layout.</li>
<li><code>RouteHandler</code> is rendered within the main layout.</li>
<li>Owns the global app state.</li>
</ul>
</div>
</div>
<div id="outline-container-orge183bcb" class="outline-5">
<h5 id="orge183bcb"><span class="section-number-5">1.2.1.4</span> Pages</h5>
<div class="outline-text-5" id="text-1-2-1-4">
<ul class="org-ul">
<li>Top-level components for app areas.</li>
<li>Composition roots for all functionalities related to the specific area.</li>
<li>Additionally taking care of setting page titles, rendering headers, etc.</li>
</ul>
</div>
</div>
<div id="outline-container-org25eca4c" class="outline-5">
<h5 id="org25eca4c"><span class="section-number-5">1.2.1.5</span> Components</h5>
<div class="outline-text-5" id="text-1-2-1-5">
<ul class="org-ul">
<li>Define the way of displaying data in the UI.</li>
<li>Provide connection points (event handlers etc.) for invoking actions.</li>
<li>Data is passed through props.</li>
<li>State should be kept as high up as possible (optimally in the App), state owners have to be clearly defined.</li>
</ul>
</div>
</div>

<div id="outline-container-orgbfd8c02" class="outline-5">
<h5 id="orgbfd8c02"><span class="section-number-5">1.2.1.6</span> Actions</h5>
<div class="outline-text-5" id="text-1-2-1-6">
<ul class="org-ul">
<li>Each logical part of the app has its own <code>actions.js</code> file, exposing action creator functions.
They perform logical validation and call the dispatcher to actually dispatch the created actions.</li>
</ul>
</div>
</div>
<div id="outline-container-orge644fd3" class="outline-5">
<h5 id="orge644fd3"><span class="section-number-5">1.2.1.7</span> Stores</h5>
<div class="outline-text-5" id="text-1-2-1-7">
<ul class="org-ul">
<li>Stores react to dispatched actions and update the global application state.</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org060c51a" class="outline-4">
<h4 id="org060c51a"><span class="section-number-4">1.2.2</span> <span class="done DONE">DONE</span> State</h4>
<div class="outline-text-4" id="text-1-2-2">
<ul class="org-ul">
<li><code>lib/state.js</code> implements a state representation.</li>
<li>Based on immutable data structures.</li>
<li>Emits change events (previous state is kept for diffing while debugging).</li>
<li>It can be <b>revived</b> provided a <code>storesReviver</code> function.
<ul class="org-ul">
<li>The <code>storesReviver</code> delegates to data-specific revivers.</li>
<li><code>state.js</code> imports all revivers.</li>
<li>Instantiating the <code>State</code> class causes the state to be loaded from a server file or from <code>window._appState</code>.</li>
<li>Loading state uses a data-specific reviver as a custom transform function for the `Immutable.fromJS` method.</li>
</ul></li>
</ul>
</div>
<div id="outline-container-org01fdf02" class="outline-5">
<h5 id="org01fdf02"><span class="section-number-5">1.2.2.1</span> <span class="done DONE">DONE</span> Pending actions</h5>
<div class="outline-text-5" id="text-1-2-2-1">
<ul class="org-ul">
<li>Whenever any action is dispatched, the dispatcher implementation uses a cursor on a pending actions hashmap (which can be hydrated from the server).</li>
<li>The action key (acquired from overriding <code>.toString()</code> by <code>setToString</code>) is set to <code>true</code> before the actual action promise dispatch and to <code>false</code> after its resolution.</li>
<li>This is useful when a loader needs to be displayed or as a logical action debouncing.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-orgb3d27ac" class="outline-3">
<h3 id="orgb3d27ac"><span class="section-number-3">1.3</span> Concepts</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-org396f016" class="outline-4">
<h4 id="org396f016"><span class="section-number-4">1.3.1</span> <span class="done DONE">DONE</span> Immutable data structures</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
One of the more popular immutable data structure libs for JS is immutable.js.
Immutability reduces complexity due to not having to handle changes to a on object as in mutable data structures.
A whole class of bugs is eliminated thusly.
On top of that, immutable data structures allow a host of optimizations due to their nature.
</p>
</div>
<div id="outline-container-orgf10a21b" class="outline-5">
<h5 id="orgf10a21b"><span class="section-number-5">1.3.1.1</span> Optimizations</h5>
<div class="outline-text-5" id="text-1-3-1-1">
<ul class="org-ul">
<li>Thanks to structural sharing (i.e. reusing parts of data structures that were extended), the memory footprint is lesser than with e.g. copy-on-write data structures.
Speed is also improved.</li>
<li>immutable.js uses <code>===</code> for equality checks and tries to return the existing collection when an operation would result in an identical collection.
This is useful in memoization when running a deeper equality check could be more costly than re-running the memoized function.</li>
</ul>
</div>
</div>
<div id="outline-container-org24bec02" class="outline-5">
<h5 id="org24bec02"><span class="section-number-5">1.3.1.2</span> API</h5>
<div class="outline-text-5" id="text-1-3-1-2">
<ul class="org-ul">
<li><code>Map</code>, <code>OrderedMap</code>, <code>List</code>, <code>Seq</code></li>
<li>Accept raw objects, arrays etc. as input</li>
<li>Can be converted back to raw objects: shallowly with <code>.toArray()</code> or <code>.toObject()</code> and deeply with <code>.toJS()</code>.</li>
<li>All immutable iterables implement <code>toJSON()</code> which means that they can be passed directly to <code>JSON.stringify</code>.</li>
<li>The structures are intended to be nested.
Lens methods are provided on <code>List</code>, <code>Map</code> and <code>OrderedMap</code>: <code>getIn</code>, <code>setIn</code>, <code>updateIn</code> as well as a <code>mergeDeep</code> method.</li>
<li><code>Seq</code> is lazy.
It has functor-like methods <code>map</code>, <code>filter</code> etc. - but only unfolds when needed.
This allows to operate on them like in Haskell, create infinite ranges etc.</li>
<li>Equality is based on values, not references.</li>
</ul>
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #b5bd68;">var</span> <span style="color: #f0c674;">map1</span> = Immutable.Map<span style="color: #c5c8c6;">(</span><span style="color: #8abeb7;">{</span>a:<span style="color: #81a2be;">1</span>, b:<span style="color: #81a2be;">1</span>, c:<span style="color: #81a2be;">1</span><span style="color: #8abeb7;">}</span><span style="color: #c5c8c6;">)</span>;
<span style="color: #b5bd68;">var</span> <span style="color: #f0c674;">map2</span> = Immutable.Map<span style="color: #c5c8c6;">(</span><span style="color: #8abeb7;">{</span>a:<span style="color: #81a2be;">1</span>, b:<span style="color: #81a2be;">1</span>, c:<span style="color: #81a2be;">1</span><span style="color: #8abeb7;">}</span><span style="color: #c5c8c6;">)</span>;
assert<span style="color: #c5c8c6;">(</span>map1 !== map2<span style="color: #c5c8c6;">)</span>; <span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">two different instances</span>
assert<span style="color: #c5c8c6;">(</span>Immutable.is<span style="color: #8abeb7;">(</span>map1, map2<span style="color: #8abeb7;">)</span><span style="color: #c5c8c6;">)</span>; <span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">have equivalent values</span>
assert<span style="color: #c5c8c6;">(</span>map1.equals<span style="color: #8abeb7;">(</span>map2<span style="color: #8abeb7;">)</span><span style="color: #c5c8c6;">)</span>; <span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">alternatively use the equals method</span>
</pre>
</div>
</div>
</div>
</div>
