public/react.org
*** DONE PropTypes
    - A mechanism provided by React itself.
    - Allow defining constraints on what the component expect to get passed as props.
    - Violating the contract established by =PropTypes= will cause a =console.warn= to be issued.
    - A =getDefaultProps= function can be implemented to provide a default set of properties. 
      It is called as soon as =React.createClass= is called on the component, so no instance-specific references can be used within it.
      Default values should be provided only for properties that are not required (i.e. their =propType= doesn't have =.isRequired= specified).
      
#+begin_src javascript
var SurveyTableRow = React.createClass({
    propTypes: {
        survey: React.PropTypes.shape({
            id: React.PropTypes.number.isRequired
        }).isRequired,
        onClick: React.PropTypes.func
    },
});

var SurveyTable = React.createClass({
    getDefaultProps: function () {
        return {
            surveys: []
            };
    }
});
#+end_src

Create the getDefaultProps function on your component to provide a default set of
properties. This should only be done for props that aren’t required.
It’s important to note that getDefaultProps is not called during component in-
stantiation, but as soon as React.createClass is called to cache the value. This
means you can’t use any instance specific data in the getDefaultProps method.

*** TODO Higher order components https://medium.com/@dan_abramov/mixins-are-dead-long-live-higher-order-components-94a0d2f9e750
**** Mixins
     There are three main use cases for React mixins: utility functions, lifecycle hooks and state providers.
     Mixins are on their way out starting from 0.13 though. 
     If you use mixins for utility functions, extract them to modules.
     They were more useful though when used for the other cases.
     This is due to React "merging" lifecycle hooks - if both the component and its mixins have defined a lifecycle hook (i.e. =componentDidMount=), then React will merge them.
     The same applies to =getInitialState=.
     This is useful - mixins can subscribe components to Flux stores or work with their DOM nodes after being updated.
     There are drawbacks to mixins though:
     - The mixin <-> component contract is implicit.
     - Use too many mixins and they will start to clash.
       React will throw exceptions if you use two different instances of the same mixin even with different parameters.
     - They tend to add more state to components.
     - They complicate performance optimizations.
       If you implement the =shouldComponentUpdate= method in your component, different mixins might need their own implementations.

