react.html



<div id="outline-container-org9d18eee" class="outline-4">
<h4 id="org9d18eee"><span class="section-number-4">1.3.2</span> <span class="done DONE">DONE</span> PropTypes</h4>
<div class="outline-text-4" id="text-1-3-2">
<ul class="org-ul">
<li>A mechanism provided by React itself.</li>
<li>Allow defining constraints on what the component expect to get passed as props.</li>
<li>Violating the contract established by <code>PropTypes</code> will cause a <code>console.warn</code> to be issued.</li>
<li>A <code>getDefaultProps</code> function can be implemented to provide a default set of properties. 
It is called as soon as <code>React.createClass</code> is called on the component, so no instance-specific references can be used within it.
Default values should be provided only for properties that are not required (i.e. their <code>propType</code> doesn't have <code>.isRequired</code> specified).</li>
</ul>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #b5bd68;">var</span> <span style="color: #f0c674;">SurveyTableRow</span> = React.createClass<span style="color: #c5c8c6;">(</span><span style="color: #8abeb7;">{</span>
    propTypes: <span style="color: #f0c674;">{</span>
        survey: React.PropTypes.shape<span style="color: #b5bd68;">(</span><span style="color: #81a2be;">{</span>
            id: React.PropTypes.number.isRequired
        <span style="color: #81a2be;">}</span><span style="color: #b5bd68;">)</span>.isRequired,
        onClick: React.PropTypes.func
    <span style="color: #f0c674;">}</span>,
<span style="color: #8abeb7;">}</span><span style="color: #c5c8c6;">)</span>;

<span style="color: #b5bd68;">var</span> <span style="color: #f0c674;">SurveyTable</span> = React.createClass<span style="color: #c5c8c6;">(</span><span style="color: #8abeb7;">{</span>
    <span style="color: #de935f;">getDefaultProps</span>: <span style="color: #b5bd68;">function</span> <span style="color: #f0c674;">()</span> <span style="color: #f0c674;">{</span>
        <span style="color: #b5bd68;">return</span> <span style="color: #b5bd68;">{</span>
            surveys: <span style="color: #81a2be;">[]</span>
            <span style="color: #b5bd68;">}</span>;
    <span style="color: #f0c674;">}</span>
<span style="color: #8abeb7;">}</span><span style="color: #c5c8c6;">)</span>;
</pre>
</div>

<p>
Create the getDefaultProps function on your component to provide a default set of
properties. This should only be done for props that aren’t required.
It’s important to note that getDefaultProps is not called during component in-
stantiation, but as soon as React.createClass is called to cache the value. This
means you can’t use any instance specific data in the getDefaultProps method.
</p>
</div>
</div>

<div id="outline-container-org35c881c" class="outline-4">
<h4 id="org35c881c"><span class="section-number-4">1.3.3</span> <span class="todo TODO">TODO</span> Higher order components <a href="https://medium.com/@dan_abramov/mixins-are-dead-long-live-higher-order-components-94a0d2f9e750">https://medium.com/@dan_abramov/mixins-are-dead-long-live-higher-order-components-94a0d2f9e750</a></h4>
<div class="outline-text-4" id="text-1-3-3">
</div><div id="outline-container-org1e391bf" class="outline-5">
<h5 id="org1e391bf"><span class="section-number-5">1.3.3.1</span> Mixins</h5>
<div class="outline-text-5" id="text-1-3-3-1">
<p>
There are three main use cases for React mixins: utility functions, lifecycle hooks and state providers.
Mixins are on their way out starting from 0.13 though. 
If you use mixins for utility functions, extract them to modules.
They were more useful though when used for the other cases.
This is due to React "merging" lifecycle hooks - if both the component and its mixins have defined a lifecycle hook (i.e. <code>componentDidMount</code>), then React will merge them.
The same applies to <code>getInitialState</code>.
This is useful - mixins can subscribe components to Flux stores or work with their DOM nodes after being updated.
There are drawbacks to mixins though:
</p>
<ul class="org-ul">
<li>The mixin &lt;-&gt; component contract is implicit.</li>
<li>Use too many mixins and they will start to clash.
React will throw exceptions if you use two different instances of the same mixin even with different parameters.</li>
<li>They tend to add more state to components.</li>
<li>They complicate performance optimizations.
If you implement the <code>shouldComponentUpdate</code> method in your component, different mixins might need their own implementations.</li>
</ul>
</div>
</div>
