public/react.org
**** Higher-order components
     This is one of the proposed ways to replace mixins with composition.
     Using ES6 classes, it boils down to inheritance.
     Taking the Flux Store connection mixin as an example, this is how you would implement it in the old way:
#+begin_src javascript
function StoreMixin(...stores) {
  const Mixin = {
    getInitialState() {
      return this.getStateFromStores(this.props);
    },
    componentDidMount() {
      stores.forEach(store => store.addChangeListener(this.handleStoresChanged));
    },
    componentWillUnmount() {
      stores.forEach(store => store.removeChangeListener(this.handleStoresChanged));
    },
    handleStoresChanged() {
      if(this.isMounted()) {
        this.setState(this.getStateFromStores(this.props));
      }
    }
  };

  return Mixin;
}

const UserProfilePage = React.createClass({
  mixins: [StoreMixin(UserStore)],
  propTypes: {
    userId: PropTypes.number.isRequired
  },
  getStateFromStores(props) {
    return {
      user: UserStore.get(props.userId)
    };
  },
  render() {
    const {user} = this.state;
    return (
        <div>
        {user ? user.name : 'Loading'}
        </div>
    );
  }
});
#+end_src
     With the higher-order component approach it would look thusly.
#+begin_src javascript
const connectToStores = (ComposedComponent, stores, getStateFromStores) => {
    return class extends React.Component {
        getInitialState() {
            return getStateFromStores(this.props);
        }

        componentDidMount() {
            stores.forEach(store => store.addChangeListener(this.handleStoresChanged));
        }

        componentWillUnmount() {
            stores.forEach(store => store.removeChangeListener(this.handleStoresChanged));
        }

        handleStoresChanged() {
            if(this.isMounted()) {
            this.setState(getStateFromStores(this.props));
            }
        }

        render() {
            return (<ComposedComponent {...this.props} {...this.state} />);
        }
        };

        class ProfilePage extends React.Component {
        static propTypes = {
            userId: PropTypes.number.isRequired,
            user: PropTypes.object // user becomes a prop
        };

        render() {
            var { user } = this.props;
            return (
                <div>
                {user ? user.name: 'Loading'}
            </div>
            );
        }
    }
}

export
default connectToStores(
    ProfilePage, [UserStore], props => ({
        user: UserStore.get(props.userId)
    }));
#+end_src
     Key benefits of this approach:
     - Wrapping the component and passing additional props to it instead of managing state.
     - Wrapper's lifecycle hooks work without any special merging, just by virtue of composition.

