react.html

<div id="outline-container-org27a6c29" class="outline-5">
<h5 id="org27a6c29"><span class="section-number-5">1.3.3.2</span> Higher-order components</h5>
<div class="outline-text-5" id="text-1-3-3-2">
<p>
This is one of the proposed ways to replace mixins with composition.
Using ES6 classes, it boils down to inheritance.
Taking the Flux Store connection mixin as an example, this is how you would implement it in the old way:
</p>
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #b5bd68;">function</span> <span style="color: #de935f;">StoreMixin</span><span style="color: #c5c8c6;">(</span>...stores<span style="color: #c5c8c6;">)</span> <span style="color: #c5c8c6;">{</span>
  <span style="color: #b5bd68;">const</span> <span style="color: #f0c674;">Mixin</span> = <span style="color: #8abeb7;">{</span>
    getInitialState<span style="color: #f0c674;">()</span> <span style="color: #f0c674;">{</span>
      <span style="color: #b5bd68;">return</span> <span style="color: #81a2be;">this</span>.getStateFromStores<span style="color: #b5bd68;">(</span><span style="color: #81a2be;">this</span>.props<span style="color: #b5bd68;">)</span>;
    <span style="color: #f0c674;">}</span>,
    componentDidMount<span style="color: #f0c674;">()</span> <span style="color: #f0c674;">{</span>
      stores.forEach<span style="color: #b5bd68;">(</span>store =&gt; store.addChangeListener<span style="color: #81a2be;">(</span><span style="color: #81a2be;">this</span>.handleStoresChanged<span style="color: #81a2be;">)</span><span style="color: #b5bd68;">)</span>;
    <span style="color: #f0c674;">}</span>,
    componentWillUnmount<span style="color: #f0c674;">()</span> <span style="color: #f0c674;">{</span>
      stores.forEach<span style="color: #b5bd68;">(</span>store =&gt; store.removeChangeListener<span style="color: #81a2be;">(</span><span style="color: #81a2be;">this</span>.handleStoresChanged<span style="color: #81a2be;">)</span><span style="color: #b5bd68;">)</span>;
    <span style="color: #f0c674;">}</span>,
    handleStoresChanged<span style="color: #f0c674;">()</span> <span style="color: #f0c674;">{</span>
      <span style="color: #b5bd68;">if</span><span style="color: #b5bd68;">(</span><span style="color: #81a2be;">this</span>.isMounted<span style="color: #81a2be;">()</span><span style="color: #b5bd68;">)</span> <span style="color: #b5bd68;">{</span>
        <span style="color: #81a2be;">this</span>.setState<span style="color: #81a2be;">(</span><span style="color: #81a2be;">this</span>.getStateFromStores<span style="color: #c5c8c6;">(</span><span style="color: #81a2be;">this</span>.props<span style="color: #c5c8c6;">)</span><span style="color: #81a2be;">)</span>;
      <span style="color: #b5bd68;">}</span>
    <span style="color: #f0c674;">}</span>
  <span style="color: #8abeb7;">}</span>;

  <span style="color: #b5bd68;">return</span> Mixin;
<span style="color: #c5c8c6;">}</span>

<span style="color: #b5bd68;">const</span> <span style="color: #f0c674;">UserProfilePage</span> = React.createClass<span style="color: #c5c8c6;">(</span><span style="color: #8abeb7;">{</span>
  mixins: <span style="color: #f0c674;">[</span>StoreMixin<span style="color: #b5bd68;">(</span>UserStore<span style="color: #b5bd68;">)</span><span style="color: #f0c674;">]</span>,
  propTypes: <span style="color: #f0c674;">{</span>
    userId: PropTypes.number.isRequired
  <span style="color: #f0c674;">}</span>,
  getStateFromStores<span style="color: #f0c674;">(</span>props<span style="color: #f0c674;">)</span> <span style="color: #f0c674;">{</span>
    <span style="color: #b5bd68;">return</span> <span style="color: #b5bd68;">{</span>
      user: UserStore.get<span style="color: #81a2be;">(</span>props.userId<span style="color: #81a2be;">)</span>
    <span style="color: #b5bd68;">}</span>;
  <span style="color: #f0c674;">}</span>,
  render<span style="color: #f0c674;">()</span> <span style="color: #f0c674;">{</span>
    <span style="color: #b5bd68;">const</span> <span style="color: #b5bd68;">{</span>user<span style="color: #b5bd68;">}</span> = <span style="color: #81a2be;">this</span>.state;
    <span style="color: #b5bd68;">return</span> <span style="color: #b5bd68;">(</span>
        &lt;div&gt;
        <span style="color: #81a2be;">{</span>user ? user.name : <span style="color: #8abeb7;">'Loading'</span><span style="color: #81a2be;">}</span>
        &lt;/div&gt;
    <span style="color: #b5bd68;">)</span>;
  <span style="color: #f0c674;">}</span>
<span style="color: #8abeb7;">}</span><span style="color: #c5c8c6;">)</span>;
</pre>
</div>
<p>
With the higher-order component approach it would look thusly.
</p>
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #b5bd68;">const</span> <span style="color: #f0c674;">connectToStores</span> = <span style="color: #c5c8c6;">(</span>ComposedComponent, stores, getStateFromStores<span style="color: #c5c8c6;">)</span> =&gt; <span style="color: #c5c8c6;">{</span>
    <span style="color: #b5bd68;">return</span> <span style="color: #b5bd68;">class</span> <span style="color: #b5bd68;">extends</span> React.Component <span style="color: #8abeb7;">{</span>
        getInitialState<span style="color: #f0c674;">()</span> <span style="color: #f0c674;">{</span>
            <span style="color: #b5bd68;">return</span> getStateFromStores<span style="color: #b5bd68;">(</span><span style="color: #81a2be;">this</span>.props<span style="color: #b5bd68;">)</span>;
        <span style="color: #f0c674;">}</span>

        componentDidMount<span style="color: #f0c674;">()</span> <span style="color: #f0c674;">{</span>
            stores.forEach<span style="color: #b5bd68;">(</span>store =&gt; store.addChangeListener<span style="color: #81a2be;">(</span><span style="color: #81a2be;">this</span>.handleStoresChanged<span style="color: #81a2be;">)</span><span style="color: #b5bd68;">)</span>;
        <span style="color: #f0c674;">}</span>

        componentWillUnmount<span style="color: #f0c674;">()</span> <span style="color: #f0c674;">{</span>
            stores.forEach<span style="color: #b5bd68;">(</span>store =&gt; store.removeChangeListener<span style="color: #81a2be;">(</span><span style="color: #81a2be;">this</span>.handleStoresChanged<span style="color: #81a2be;">)</span><span style="color: #b5bd68;">)</span>;
        <span style="color: #f0c674;">}</span>

        handleStoresChanged<span style="color: #f0c674;">()</span> <span style="color: #f0c674;">{</span>
            <span style="color: #b5bd68;">if</span><span style="color: #b5bd68;">(</span><span style="color: #81a2be;">this</span>.isMounted<span style="color: #81a2be;">()</span><span style="color: #b5bd68;">)</span> <span style="color: #b5bd68;">{</span>
            <span style="color: #81a2be;">this</span>.setState<span style="color: #81a2be;">(</span>getStateFromStores<span style="color: #c5c8c6;">(</span><span style="color: #81a2be;">this</span>.props<span style="color: #c5c8c6;">)</span><span style="color: #81a2be;">)</span>;
            <span style="color: #b5bd68;">}</span>
        <span style="color: #f0c674;">}</span>

        render<span style="color: #f0c674;">()</span> <span style="color: #f0c674;">{</span>
            <span style="color: #b5bd68;">return</span> <span style="color: #b5bd68;">(</span>&lt;ComposedComponent <span style="color: #81a2be;">{</span>...<span style="color: #81a2be;">this</span>.props<span style="color: #81a2be;">}</span> <span style="color: #81a2be;">{</span>...<span style="color: #81a2be;">this</span>.state<span style="color: #81a2be;">}</span> /&gt;<span style="color: #b5bd68;">)</span>;
        <span style="color: #f0c674;">}</span>
        <span style="color: #8abeb7;">}</span>;

        <span style="color: #b5bd68;">class</span> ProfilePage <span style="color: #b5bd68;">extends</span> React.Component <span style="color: #8abeb7;">{</span>
        <span style="color: #b5bd68;">static</span> propTypes = <span style="color: #f0c674;">{</span>
            userId: PropTypes.number.isRequired,
            user: PropTypes.object <span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">user becomes a prop</span>
        <span style="color: #f0c674;">}</span>;

        render<span style="color: #f0c674;">()</span> <span style="color: #f0c674;">{</span>
            <span style="color: #b5bd68;">var</span> <span style="color: #b5bd68;">{</span> user <span style="color: #b5bd68;">}</span> = <span style="color: #81a2be;">this</span>.props;
            <span style="color: #b5bd68;">return</span> <span style="color: #b5bd68;">(</span>
                &lt;div&gt;
                <span style="color: #81a2be;">{</span>user ? user.name: <span style="color: #8abeb7;">'Loading'</span><span style="color: #81a2be;">}</span>
            &lt;/div&gt;
            <span style="color: #b5bd68;">)</span>;
        <span style="color: #f0c674;">}</span>
    <span style="color: #8abeb7;">}</span>
<span style="color: #c5c8c6;">}</span>

<span style="color: #b5bd68;">export</span>
<span style="color: #b5bd68;">default</span> connectToStores<span style="color: #c5c8c6;">(</span>
    ProfilePage, <span style="color: #8abeb7;">[</span>UserStore<span style="color: #8abeb7;">]</span>, props =&gt; <span style="color: #8abeb7;">(</span><span style="color: #f0c674;">{</span>
        user: UserStore.get<span style="color: #b5bd68;">(</span>props.userId<span style="color: #b5bd68;">)</span>
    <span style="color: #f0c674;">}</span><span style="color: #8abeb7;">)</span><span style="color: #c5c8c6;">)</span>;
</pre>
</div>
<p>
Key benefits of this approach:
</p>
<ul class="org-ul">
<li>Wrapping the component and passing additional props to it instead of managing state.</li>
<li>Wrapper's lifecycle hooks work without any special merging, just by virtue of composition.</li>
</ul>
</div>
</div>
</div>
