public/react.org
*** DONE Routing

    Routing hierarchy (e.g. in =routes.js=):

    #+begin_src javascript
    var Router = require('react-router');
    var Route = Router.Route;

    // declare routes and their hierarchy
    var routes = (
    <Route handler={App}>
        <DefaultRoute handler={Home}/>
        <NotFoundRoute handler={NotFound} name="not-found" />
        <Route path="about" handler={About}/>
        <Route path="inbox" handler={Inbox}>
        <Route path="messages/:id" handler={Message}/>
        </Route>
    </Route>
    );
    #+end_src

- The value of =:id= in =inbox/messages/:id= will be assigned to =this.props.params.id= in the =Message= component.
- When the url is =/=, the handler from =DefaultRoute= will be activated - here, the =<RouteHandler />= in =App= will be =Home=.
- The =NotFoundRoute='s handler is activated when the beginning of its parent's path matches the URL, but none of the siblings match the rest of it.

Route handler (in =app.react.js=):

#+begin_src javascript
var RouteHandler = Router.RouteHandler;

var App = React.createClass({
  render () {
    return (
      <div>
        <h1>App</h1>
        <RouteHandler/>
      </div>
    )
  }
});
#+end_src

Bootstrap code (in =main.js=):

#+begin_src javascript
Router.run(routes, Router.HashLocation, (Root) => {
  React.render(<Root/>, document.body);
});
#+end_src

**** TODO Followup: https://github.com/acdlite/flummox/blob/v3.5.1/docs/docs/guides/why-flux-component-is-better-than-flux-mixin.md

* TODO Webpack

* Followups
** TODO https://medium.com/@nextminds/replaying-bugs-with-flux-52f6bd8c8307
** TODO https://github.com/nextminds/FluxRecorder
** TODO http://cycle.js.org/
** TODO https://facebook.github.io/react/blog/2015/02/20/introducing-relay-and-graphql.html
** TODO https://github.com/omcljs/om
** TODO cursors e.g. https://github.com/dustingetz/react-cursor
** TODO watch https://www.youtube.com/watch?v=xsSnOQynTHs
** TODO watch React Europe https://www.youtube.com/channel/UCorlLn2oZfgOJ-FUcF2eZ1A
