react.html

<div id="outline-container-orgc93bac6" class="outline-4">
<h4 id="orgc93bac6"><span class="section-number-4">1.3.4</span> <span class="done DONE">DONE</span> Routing</h4>
<div class="outline-text-4" id="text-1-3-4">
<p>
Routing hierarchy (e.g. in <code>routes.js</code>):
</p>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #b5bd68;">var</span> <span style="color: #f0c674;">Router</span> = require<span style="color: #c5c8c6;">(</span><span style="color: #8abeb7;">'react-router'</span><span style="color: #c5c8c6;">)</span>;
<span style="color: #b5bd68;">var</span> <span style="color: #f0c674;">Route</span> = Router.Route;

<span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">declare routes and their hierarchy</span>
<span style="color: #b5bd68;">var</span> <span style="color: #f0c674;">routes</span> = <span style="color: #c5c8c6;">(</span>
&lt;Route handler=<span style="color: #8abeb7;">{</span>App<span style="color: #8abeb7;">}</span>&gt;
    &lt;DefaultRoute handler=<span style="color: #8abeb7;">{</span>Home<span style="color: #8abeb7;">}</span>/&gt;
    &lt;NotFoundRoute handler=<span style="color: #8abeb7;">{</span>NotFound<span style="color: #8abeb7;">}</span> name=<span style="color: #8abeb7;">"not-found"</span> /&gt;
    &lt;Route path=<span style="color: #8abeb7;">"about"</span> handler=<span style="color: #8abeb7;">{</span>About<span style="color: #8abeb7;">}</span>/&gt;
    &lt;Route path=<span style="color: #8abeb7;">"inbox"</span> handler=<span style="color: #8abeb7;">{</span>Inbox<span style="color: #8abeb7;">}</span>&gt;
    &lt;Route path=<span style="color: #8abeb7;">"messages/:id"</span> handler=<span style="color: #8abeb7;">{</span>Message<span style="color: #8abeb7;">}</span>/&gt;
    &lt;/Route&gt;
&lt;/Route&gt;
<span style="color: #c5c8c6;">)</span>;
</pre>
</div>

<ul class="org-ul">
<li>The value of <code>:id</code> in <code>inbox/messages/:id</code> will be assigned to <code>this.props.params.id</code> in the <code>Message</code> component.</li>
<li>When the url is <code>/</code>, the handler from <code>DefaultRoute</code> will be activated - here, the <code>&lt;RouteHandler /&gt;</code> in <code>App</code> will be <code>Home</code>.</li>
<li>The <code>NotFoundRoute</code>'s handler is activated when the beginning of its parent's path matches the URL, but none of the siblings match the rest of it.</li>
</ul>

<p>
Route handler (in <code>app.react.js</code>):
</p>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #b5bd68;">var</span> <span style="color: #f0c674;">RouteHandler</span> = Router.RouteHandler;

<span style="color: #b5bd68;">var</span> <span style="color: #f0c674;">App</span> = React.createClass<span style="color: #c5c8c6;">(</span><span style="color: #8abeb7;">{</span>
  render <span style="color: #f0c674;">()</span> <span style="color: #f0c674;">{</span>
    <span style="color: #b5bd68;">return</span> <span style="color: #b5bd68;">(</span>
      &lt;div&gt;
        &lt;h1&gt;App&lt;/h1&gt;
        &lt;RouteHandler/&gt;
      &lt;/div&gt;
    <span style="color: #b5bd68;">)</span>
  <span style="color: #f0c674;">}</span>
<span style="color: #8abeb7;">}</span><span style="color: #c5c8c6;">)</span>;
</pre>
</div>

<p>
Bootstrap code (in <code>main.js</code>):
</p>

<div class="org-src-container">
<pre class="src src-javascript">Router.run<span style="color: #c5c8c6;">(</span>routes, Router.HashLocation, <span style="color: #8abeb7;">(</span>Root<span style="color: #8abeb7;">)</span> =&gt; <span style="color: #8abeb7;">{</span>
  React.render<span style="color: #f0c674;">(</span>&lt;Root/&gt;, document.body<span style="color: #f0c674;">)</span>;
<span style="color: #8abeb7;">}</span><span style="color: #c5c8c6;">)</span>;
</pre>
</div>
</div>

<div id="outline-container-org9c96943" class="outline-5">
<h5 id="org9c96943"><span class="section-number-5">1.3.4.1</span> <span class="todo TODO">TODO</span> Followup: <a href="https://github.com/acdlite/flummox/blob/v3.5.1/docs/docs/guides/why-flux-component-is-better-than-flux-mixin.md">https://github.com/acdlite/flummox/blob/v3.5.1/docs/docs/guides/why-flux-component-is-better-than-flux-mixin.md</a></h5>
</div>
</div>
</div>
</div>

<div id="outline-container-org98f94e2" class="outline-2">
<h2 id="org98f94e2"><span class="section-number-2">2</span> <span class="todo TODO">TODO</span> Webpack</h2>
</div>

<div id="outline-container-orge9a6ddf" class="outline-2">
<h2 id="orge9a6ddf"><span class="section-number-2">3</span> Followups</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-org0c687b8" class="outline-3">
<h3 id="org0c687b8"><span class="section-number-3">3.1</span> <span class="todo TODO">TODO</span> <a href="https://medium.com/@nextminds/replaying-bugs-with-flux-52f6bd8c8307">https://medium.com/@nextminds/replaying-bugs-with-flux-52f6bd8c8307</a></h3>
</div>
<div id="outline-container-org3b34470" class="outline-3">
<h3 id="org3b34470"><span class="section-number-3">3.2</span> <span class="todo TODO">TODO</span> <a href="https://github.com/nextminds/FluxRecorder">https://github.com/nextminds/FluxRecorder</a></h3>
</div>
<div id="outline-container-org83e63da" class="outline-3">
<h3 id="org83e63da"><span class="section-number-3">3.3</span> <span class="todo TODO">TODO</span> <a href="http://cycle.js.org/">http://cycle.js.org/</a></h3>
</div>
<div id="outline-container-orgf2636b8" class="outline-3">
<h3 id="orgf2636b8"><span class="section-number-3">3.4</span> <span class="todo TODO">TODO</span> <a href="https://facebook.github.io/react/blog/2015/02/20/introducing-relay-and-graphql.html">https://facebook.github.io/react/blog/2015/02/20/introducing-relay-and-graphql.html</a></h3>
</div>
<div id="outline-container-org28d53ea" class="outline-3">
<h3 id="org28d53ea"><span class="section-number-3">3.5</span> <span class="todo TODO">TODO</span> <a href="https://github.com/omcljs/om">https://github.com/omcljs/om</a></h3>
</div>
<div id="outline-container-org25a4fb2" class="outline-3">
<h3 id="org25a4fb2"><span class="section-number-3">3.6</span> <span class="todo TODO">TODO</span> cursors e.g. <a href="https://github.com/dustingetz/react-cursor">https://github.com/dustingetz/react-cursor</a></h3>
</div>
<div id="outline-container-org7d94406" class="outline-3">
<h3 id="org7d94406"><span class="section-number-3">3.7</span> <span class="todo TODO">TODO</span> watch <a href="https://www.youtube.com/watch?v=xsSnOQynTHs">https://www.youtube.com/watch?v=xsSnOQynTHs</a></h3>
</div>
<div id="outline-container-org3f83947" class="outline-3">
<h3 id="org3f83947"><span class="section-number-3">3.8</span> <span class="todo TODO">TODO</span> watch React Europe <a href="https://www.youtube.com/channel/UCorlLn2oZfgOJ-FUcF2eZ1A">https://www.youtube.com/channel/UCorlLn2oZfgOJ-FUcF2eZ1A</a></h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author:  (<a href="mailto:elkorn@arch">elkorn@arch</a>)</p>
<p class="date">Date: </p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 9.0.3)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
